In [3]:
import numpy as np
import pandas as pd
df = pd.read_csv("F:\Iphone.csv")
df.head(10)

   Gender  Age  Salary  Puchased iphone
0    Male   19   19000                0
1    Male   35   20000                0
2  Female   26   43000                0
3  Female   27   57000                0
4    Male   19   76000                0
5    Male   27   58000                0
6  Female   27   84000                0
7  Female   32  150000                1
8    Male   25   33000                0
9  Female   35   65000                0

In [4]:
df.columns

Index(['Gender', 'Age', 'Salary', 'Puchased iphone'], dtype='object')

In [5]:
df.info

<bound method DataFrame.info of     Gender  Age  Salary  Puchased iphone
0     Male   19   19000                0
1     Male   35   20000                0
2   Female   26   43000                0
3   Female   27   57000                0
4     Male   19   76000                0
5     Male   27   58000                0
6   Female   27   84000                0
7   Female   32  150000                1
8     Male   25   33000                0
9   Female   35   65000                0
10  Female   26   80000                0
11  Female   26   52000                0
12    Male   20   86000                0
13    Male   32   18000                0
14    Male   18   82000                0
15    Male   29   80000                0
16    Male   47   25000                1
17    Male   45   26000                1
18    Male   46   28000                1>

In [6]:
df["Puchased iphone"].unique()

array([0, 1], dtype=int64)

In [7]:
df.shape

(19, 4)

In [8]:
y=df["Puchased iphone"]

In [9]:
x=df.drop("Puchased iphone", axis=1)
x.head()

   Gender  Age  Salary
0    Male   19   19000
1    Male   35   20000
2  Female   26   43000
3  Female   27   57000
4    Male   19   76000

In [10]:
x.isna().sum()

Gender    0
Age       0
Salary    0
dtype: int64

In [11]:
y.isna().sum()

0

In [12]:
x.dtypes

Gender    object
Age        int64
Salary     int64
dtype: object

In [13]:
x=pd.get_dummies(x,columns=["Gender"],drop_first=True)
x.head()

   Age  Salary  Gender_Male
0   19   19000            1
1   35   20000            1
2   26   43000            0
3   27   57000            0
4   19   76000            1

In [14]:
type(x)

pandas.core.frame.DataFrame

In [ ]:
from sklearn.model_selection import train_test_split

In [ ]:
x_train,x_test,y_train,y_test = train_test_split(x,y,test_size=0.3,random_state=42)

In [ ]:
from sklearn.preprocessing import MinMaxScaler

In [ ]:
Scaler = MinMaxScaler

In [ ]:
x_train = Scaler.fit_transform(x_train)

In [ ]:
x_test = Scaler.transform(x_test)

In [ ]:
from sklearn.tree import DecisionTreeClassifier

In [ ]:
tree = DecisionTreeClassifier()

In [ ]:
tree.fit(x_train, y_train)

In [ ]:
tree.score(x_test,y_test)